{"text": "Rotherham United have signed Sheffield Wednesday forward Mallik Wilks on a season-long loan deal."}
{"text": "Bournemouth have completed the signing of Brazilian striker Evanilson from Porto in a club record Â£40.2m deal."}
{"text": "Nottingham Forest have signed Paraguay forward Ramon Sosa for Â£9.3m from Talleres."}
{"text": "Stoke City have signed Republic of Ireland midfielder Andrew Moran on a season-long loan from Brighton & Hove Albion."}
{"text": "Tottenham Hotspur have signed winger Wilson Odobert from Burnley for a fee in the region of Â£25m, on a deal until 2029."}
{"text": "AFC Wimbledon have signed centre-back Riley Harbottle from Hibernian on a two-year deal."}
{"text": "Experienced striker Gary Madine has signed for National League club Hartlepool United."}
{"text": "Morecambe have signed Liverpool defender Rhys Williams on loan until January."}
{"text": "Brighton have completed the signing of French forward Georginio Rutter for a club record fee of Â£40m from Leeds."}
{"text": "Brentford have signed defender Sepp van den Berg from Liverpool in a deal worth up to Â£25m."}
{"text": "Notts County have signed Lucas Ness from League One side Charlton Athletic for an undisclosed fee."}
{"text": "Ipswich are set to sign Chelsea striker Armando Broja on a season-long loan in a deal that could become permanent."}
{"text": "Fulham have signed centre-back Joachim Andersen from Crystal Palace for about Â£30m."}
{"text": "Winger Johann Berg Gudmundsson has left Burnley to join Saudi Pro League side Al-Orobah for an undisclosed fee."}
{"text": "Manchester City have completed the signing of former captain Ilkay Gundogan from Barcelona on an initial one-year deal with the option of a further 12 months."}
{"text": "Birmingham City have signed Taylor Gardner-Hickman from Championship club Bristol City."}
{"text": "Sheffield Wednesday defender Bambo Diaby has left the Championship side to join Spanish Segunda Division team Elche for an undisclosed fee."}
{"text": "Ipswich have signed Burnley defender Dara O'Shea for an initial Â£12m plus a potential Â£3m in add-ons."}
{"text": "Plymouth Argyle have signed goalkeeper Daniel Grimshaw from Blackpool for an undisclosed fee."}
{"text": "Ipswich have agreed a deal to sign forward Jack Clarke from Sunderland for an initial fee of Â£15m, plus Â£5m in potential add-ons."}
{"text": "Leicester are close to signing Crystal Palace forward Jordan Ayew for an initial Â£5m."}
{"text": "Portsmouth have signed winger Harvey Blair from Liverpool for a fee BBC Sport understands to be Â£300,000."}
{"text": "Manchester City have agreed a Â£21.2m deal with Saudi Pro League club Al-Hilal to sell defender Joao Cancelo."}
{"text": "Former Real Madrid and Everton playmaker James Rodriguez has joined La Liga club Rayo Vallecano as a free agent."}
{"text": "Brighton have signed midfielder Matt O'Riley from Scottish champions Celtic for a fee of Â£25m."}
{"text": "Ipswich have sealed the Â£8m signing of Luton winger Chiedozie Ogbene."}
{"text": "Arsenal have completed the signing of Spain midfielder Mikel Merino from Real Sociedad for a fee that could reach Â£31.6m."}
{"text": "Bournemouth have signed Chelsea goalkeeper Kepa Arrizabalaga on a season-long loan deal."}
{"text": "Liverpool have agreed a deal to sign Juventus winger Federico Chiesa."}
{"text": "Wrexham have signed striker Mo Faal from Championship club West Bromwich Albion on a contract until 2027."}
{"text": "Blackpool have signed defender Odeluga Offiah on a season-long loan deal from Premier League side Brighton & Hove Albion."}
{"text": "Crystal Palace have signed Wolfsburg centre-back Maxence Lacroix in a deal worth up to Â£18m."}
{"text": "Arsenal striker Eddie Nketiah has joined Crystal Palace for a fee in the region of Â£30m."}
{"text": "League One side Reading have signed Wolves winger Chem Campbell on loan until 5 January."}
{"text": "Manchester United have signed midfielder Manuel Ugarte from Paris St-Germain for a fee that could reach Â£50.5m."}
{"text": "Plymouth Argyle have signed midfielder Rami Al Hajj from Danish side Odense."}
{"text": "Brazilian winger Angelo Gabriel, who never played a competitive match for Chelsea, has join Saudi Pro-League side Al-Nassr from the Blues for Â£19.1m."}
{"text": "Brentford striker Ivan Toney has signed for Saudi Pro League club Al-Ahli."}
{"text": "Former Leeds United captain Liam Cooper has joined Bulgarian side CSKA Sofia."}
{"text": "Leyton Orient have signed midfielder Dominic Ball on a free transfer until the end of the season."}
{"text": "Huddersfield have won the race to sign forward Freddie Ladapo after his release by Ipswich."}
{"text": "Sheffield United goalkeeper Ivo Grbic has signed a season-long loan deal with Turkish side Caykur Rizespor."}
{"text": "Former Manchester United and Chelsea midfielder Juan Mata has joined A-League side Western Sydney Wanderers on a one-year contract."}
{"text": "Former Manchester United forward Anthony Martial has signed for Greek club AEK Athens on a three-year deal."}
{"text": "France midfielder Adrien Rabiot has joined Ligue 1 club Marseille as a free agent."}
{"text": "Luton Town have signed former Netherlands international Erik Pieters on a short-term deal."}
{"text": "Former Manchester City striker Mario Balotelli has joined Serie A club Genoa on a free transfer."}
{"text": "Carlisle United have signed midfielder Will Patching from Irish side Derry City on a two-and-a-half-year contract."}
{"text": "Huddersfield Town have announced the permanent signing of Ruben Roosken from Dutch side Heracles Alemlo for an undisclosed fee."}
{"text": "Ipswich Town have agreed a Â£20m deal to sign Aston Villa winger Jaden Philogene."}
